import { Container, Typography, Grid, Card, CardContent } from "@mui/material";
function About() {
  return (
    <Container sx={{ mt: 4, marginBottom: 4 }}>
      <Typography variant="h4" gutterBottom>
        Інформація про проект і блаблабла
      </Typography>
      <Typography variant="body1" sx={{ textAlign: "justify" }}>
        {" "}
        Перед тим як розпочати розбір ключових аспектів написання вступу та
        висновків, давайте визначимося, що таке реферат. Це академічний
        документ, який підсумовує та аналізує основну інформацію з одного або
        кількох джерел на певну тему. Основна мета реферату – надати читачам
        конкретну, засвоювану інформацію про дослідження чи дослідження у
        зручному та стислому форматі. Реферат відіграє критичну роль в
        академічному світі, оскільки він дозволяє вченим та студентам швидко
        ознайомитися з основними висновками та методами дослідження без
        необхідності прочитати всю роботу загалом. Це економить час та ресурси,
        особливо під час роботи з великими обсягами інформації. Перед тим, як
        перейти до детального розгляду вступу та висновків у рефераті, важливо
        розібратися зі структурою реферату в цілому. Мистецтво написання
        реферату починається з правильного розуміння його структури, яка є
        невід’ємним елементом ефективного та переконливого академічного
        дослідження. Перед тим, як перейти до детального розгляду вступу та
        висновків у рефераті, важливо розібратися зі структурою реферату в
        цілому. Мистецтво написання реферату починається з правильного розуміння
        його структури, яка є невід’ємним елементом ефективного та переконливого
        академічного дослідження.
      </Typography>
      <Grid container spacing={4} sx={{ mt: 2 }}>
        <Grid item xs={12} md={4}>
          <Card>
            <CardContent>
              <Typography
                variant="h6"
                sx={{ marginBottom: 2, textAlign: "center" }}
              >
                Чайка батькович:
              </Typography>
              <Typography variant="body3">Роль: Frontend Developer</Typography>
            </CardContent>
          </Card>
        </Grid>
        <Grid item xs={12} md={4}>
          <Card>
            <CardContent>
              <Typography
                variant="h6"
                sx={{ marginBottom: 2, textAlign: "center" }}
              >
                {" "}
                Фікус Ігнатович:
              </Typography>
              <Typography variant="body3">Роль: Кітичок &lt;3</Typography>
            </CardContent>
          </Card>
        </Grid>
      </Grid>
    </Container>
  );
}
export default About;
